; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image4 - mode
	spectrograph2 - mode
	spectrograph0 - mode
	thermograph7 - mode
	thermograph8 - mode
	thermograph3 - mode
	infrared10 - mode
	infrared5 - mode
	thermograph9 - mode
	infrared1 - mode
	infrared6 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star2 - direction
	Star3 - direction
	Star5 - direction
	Star4 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 image4)
	(supports instrument0 thermograph9)
	(supports instrument0 thermograph7)
	(supports instrument0 infrared6)
	(supports instrument0 infrared1)
	(supports instrument0 infrared5)
	(supports instrument0 infrared10)
	(supports instrument0 thermograph3)
	(supports instrument0 thermograph8)
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
)
(:goal (and
	(have_image Phenomenon6 spectrograph0)
	(have_image Phenomenon6 thermograph3)
	(have_image Star7 spectrograph2)
	(have_image Star7 infrared10)
	(have_image Star7 thermograph9)
	(have_image Star8 thermograph8)
	(have_image Star8 infrared10)
	(have_image Star9 infrared1)
	(have_image Star9 image4)
	(have_image Phenomenon10 thermograph8)
	(have_image Phenomenon10 infrared6)
	(have_image Phenomenon10 infrared1)
	(have_image Star11 infrared6)
	(have_image Star11 thermograph7)
))

)

; plan
1. (turn_to satellite0 star4 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star4)
   goals met: 0 of 14
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 14
3. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 0 of 14
4. (turn_to satellite0 star8 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star8)
   goals met: 0 of 14
5. (take_image satellite0 star8 instrument0 thermograph8)
   added: (have_image star8 thermograph8)
   goals met: 1 of 14
6. (take_image satellite0 star8 instrument0 infrared10)
   added: (have_image star8 infrared10)
   goals met: 2 of 14
7. (turn_to satellite0 star11 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star11)
   goals met: 2 of 14
8. (take_image satellite0 star11 instrument0 thermograph7)
   added: (have_image star11 thermograph7)
   goals met: 3 of 14
9. (take_image satellite0 star11 instrument0 infrared6)
   added: (have_image star11 infrared6)
   goals met: 4 of 14
10. (turn_to satellite0 phenomenon6 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 14
11. (take_image satellite0 phenomenon6 instrument0 thermograph3)
   added: (have_image phenomenon6 thermograph3)
   goals met: 5 of 14
12. (take_image satellite0 phenomenon6 instrument0 spectrograph0)
   added: (have_image phenomenon6 spectrograph0)
   goals met: 6 of 14
13. (turn_to satellite0 phenomenon10 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon10)
   goals met: 6 of 14
14. (take_image satellite0 phenomenon10 instrument0 infrared6)
   added: (have_image phenomenon10 infrared6)
   goals met: 7 of 14
15. (take_image satellite0 phenomenon10 instrument0 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 8 of 14
16. (take_image satellite0 phenomenon10 instrument0 thermograph8)
   added: (have_image phenomenon10 thermograph8)
   goals met: 9 of 14
17. (turn_to satellite0 star7 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star7)
   goals met: 9 of 14
18. (take_image satellite0 star7 instrument0 infrared10)
   added: (have_image star7 infrared10)
   goals met: 10 of 14
19. (take_image satellite0 star7 instrument0 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 11 of 14
20. (take_image satellite0 star7 instrument0 thermograph9)
   added: (have_image star7 thermograph9)
   goals met: 12 of 14
21. (turn_to satellite0 star9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star9)
   goals met: 12 of 14
22. (take_image satellite0 star9 instrument0 image4)
   added: (have_image star9 image4)
   goals met: 13 of 14
23. (take_image satellite0 star9 instrument0 infrared1)
   added: (have_image star9 infrared1)
   goals met: 14 of 14
